results/rocm-640649/bench_suite_rocm.conc-scaling.in1024.out128.c16.log
/opt/venv/lib/python3.12/site-packages/tvm_ffi/_optional_torch_c_dlpack.py:181: UserWarning: Failed to JIT torch c dlpack extension, EnvTensorAllocator will not be enabled.
We recommend installing via `pip install torch-c-dlpack-ext`
  warnings.warn(
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x147b7142fba0>, trust_remote_code=False, seed=0, num_prompts=64, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://172.28.9.152:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=16, model='/iopsstor/scratch/cscs/anowak/hf_cache/hub/models--zai-org--GLM-5.3/snapshots/aca966e4e02791568aa6a4ced368624b3d897f42', input_len=None, output_len=None, tokenizer='/iopsstor/scratch/cscs/anowak/hf_cache/hub/models--zai-org--GLM-5.3/snapshots/aca966e4e02791568aa6a4ced368624b3d897f42', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-727f0483-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='glm-5.3', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-17 23:46:23 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [128, 128]
WARNING: /tokenize unavailable, skipping alignment.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16

  0%|          | 0/64 [00:00<?, ?it/s]
  2%|▏         | 1/64 [00:52<55:19, 52.69s/it]
  3%|▎         | 2/64 [00:53<23:05, 22.35s/it]
  8%|▊         | 5/64 [00:54<06:21,  6.46s/it]
 17%|█▋        | 11/64 [00:57<02:09,  2.45s/it]
 19%|█▉        | 12/64 [00:58<01:59,  2.30s/it]
 27%|██▋       | 17/64 [01:46<04:40,  5.96s/it]
 28%|██▊       | 18/64 [01:47<04:06,  5.35s/it]
 33%|███▎      | 21/64 [01:48<02:32,  3.55s/it]
 38%|███▊      | 24/64 [01:51<01:46,  2.67s/it]
 42%|████▏     | 27/64 [01:52<01:12,  1.96s/it]
 48%|████▊     | 31/64 [01:57<00:54,  1.65s/it]
 52%|█████▏    | 33/64 [02:40<03:03,  5.92s/it]
 53%|█████▎    | 34/64 [02:41<02:38,  5.27s/it]
 56%|█████▋    | 36/64 [02:41<01:48,  3.88s/it]
 62%|██████▎   | 40/64 [02:43<00:57,  2.40s/it]
 67%|██████▋   | 43/64 [02:45<00:36,  1.75s/it]
 72%|███████▏  | 46/64 [02:48<00:28,  1.59s/it]
 75%|███████▌  | 48/64 [02:53<00:27,  1.73s/it]
 77%|███████▋  | 49/64 [03:33<01:47,  7.15s/it]
 78%|███████▊  | 50/64 [03:34<01:25,  6.11s/it]
 80%|███████▉  | 51/64 [03:34<01:04,  4.99s/it]
 86%|████████▌ | 55/64 [03:35<00:22,  2.49s/it]
 91%|█████████ | 58/64 [03:35<00:09,  1.63s/it]
 94%|█████████▍| 60/64 [03:36<00:05,  1.32s/it]
 98%|█████████▊| 63/64 [03:37<00:00,  1.04it/s]
100%|██████████| 64/64 [03:37<00:00,  1.16it/s]
100%|██████████| 64/64 [03:37<00:00,  3.40s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64
Failed requests:                         0
Maximum request concurrency:             16
Benchmark duration (s):                  217.71
Total input tokens:                      66304
Total generated tokens:                  8192
Request throughput (req/s):              0.29
Output token throughput (tok/s):         37.63
Peak output token throughput (tok/s):    64.00
Peak concurrent requests:                22.00
Total token throughput (tok/s):          342.19
---------------Time to First Token----------------
Mean TTFT (ms):                          9288.40
Median TTFT (ms):                        9167.90
P99 TTFT (ms):                           15265.41
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          351.04
Median TPOT (ms):                        350.15
P99 TPOT (ms):                           392.37
---------------Inter-token Latency----------------
Mean ITL (ms):                           359.03
Median ITL (ms):                         312.63
P99 ITL (ms):                            1393.12
==================================================